[
  {
    "title": "Header:",
    "rules": [
      "В хедері знаходяться логотип сайту PizzaStyle та навігація. За замовчуванням ми знаходимось на сторінці Pizza.",
      "Якщо у корзині є додані товари, біля корзини з’являється відповідна цифра. Якщо додана одна піца, то повинна світитися цифра 1, якщо додані 2 піци, то відповідно цифра 2."
    ]
  },
  {
    "title": "PizzaPage: ",
    "rules": [
      "На сторінці міститься список карток товарів.",
      "Кожна картка містить картинку товару, назву, опис, ціну та кнопку “Add to cart”",
      "При натисканні на кнопку “Add to cart” з’являється 2 кнопки “-“ (мінус) та “+“ (плюс). Також оновлюється цифра у хедері біля Cart.",
      "Кнопка “-“ (мінус) зменшує кількість цього товару у корзині. Якщо у корзині був один товар, при натисканні на “-“ (мінус) картка товару повертається у початковий стан (кнопки “-“ (мінус) та “+“ (плюс) замінюються на кнопку “Add to cart”). Також оновлюється або зникає цифра у хедері біля Cart.",
      "Кнопка “+“ (плюс) збільшує кількість цього товару у корзині. Відповідно оновлюється цифра у хедері біля Cart."
    ]
  },
  {
    "title": "CartPage: ",
    "rules": [
      "Якщо у корзині немає товарів, то відображається напис Please, choose pizza here, де here - це посилання на сторінку PizzaPage",
      "Якщо у корзині є товари, то відображаються відповідні картки товарів.",
      "Кожна картка містить картинку, назву, опис, кнопку “-“ (мінус), кількість цього товару у корзині, кнопку “+“ (плюс), ціну цього товару.",
      "Нижче під картками товарів міститься напис Total: {Сума усіх товарів} UAH.",
      "Ще нижче знаходиться кнопка Make an order. При кліку на цю кнопку корзина повністю очищається і замість карток та суми з’являється напис Please, choose pizza here."
    ]
  },
  {
    "title": "Критерії виконання:",
    "rules": [
      "Код повинен бути чистим, зі збереженням форматування. Рекомендується використання ESLint/Prettier",
      "Активна лінка (на якій сторінці ми знаходимося) повинна бути підкреслена",
      "Код розбитий на окремі компоненти."
    ]
  },
  {
    "title": "Додаткове, але не обов'язкове завдання:",
    "rules": [
      "При верстці карток товарів скористатися алгоритмом CSS Grid",
      "До кожної картки товару в корзині додати кнопку Remove (котрою можна скористатись для видалення відповідного товару з корзини)",
      "Верстка адаптивна та кросбраузерна - мобілка від 320px, планшет від 768px, десктоп від 1280px",
      "Використати підхід Mobile first"
    ]
  },
  {
    "title": "Ефект ховера:",
    "rules": [
      "Кнопки мають реверс кольорів.",
      "Картки товарів при ховері:",
      "збільшується фото товару (а не сама картка) - фото не повинно виходити за свій контейнер",
      "з'являється тінь навколо картки"
    ]
  }
]
